/***************************************************
**文件名  		：1302.h
**功能   		：DS1302时钟芯片相关的头文件，包含端口声明，函数声明等
**建立日期	：07/10/28
**版本    		：Ver1.0
**作者		：Ice Lee
**修改记录：
*****************************************************/

#ifndef _1302_H_
#define _1302_H_

#include<reg52.h>
#include<intrins.h>
#include"include/define.h"
#include"include/config.h"
/***************************************************
**				    	I/O端口声明			       **
****************************************************/
sbit DS1302_RST		=P1^2;		//ds1302芯片的rst端口
sbit DS1302_SCLK 	= P1^0;		//DS1302芯片的串行时钟接口
sbit DS1302_IO		=P1^1;		//ds1302芯片的数据IO口




/***************************************************
**			DS1302操作相关方法声明			       **
****************************************************/

/***************************************************
** 向DS1302时钟芯片写入一个byte的数据，包括写指令和写数据都可以使用此方法
**	参数：
**		byte：需要写入的数据或者指令
*****************************************************/
void write_1302_byte(uchar byte);


void write_1302(uchar address,uchar dat);
/***************************************************
** 从DS1302时钟芯片指定的地址读取一个字节数据
**	参数：
**		address：需要读取的数据的地址
**
**	返回值：
**		返回指定地址的数据
*****************************************************/
uchar read_1302(uchar address);


#endif